УчетВУправляющихДляГит1/src/DocumentJournals/ЖурналОпераций/ЖурналОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DocumentJournal>
  <name>ЖурналОпераций</name>
  <registeredDocuments>Document.АвансовыйОтчет</registeredDocuments>
  <registeredDocuments>Document.ОперацияБух</registeredDocuments>
  <registeredDocuments>Document.ОтчетКомиссионераОПродажах</registeredDocuments>
  <registeredDocuments>Document.ОтчетКомитентуОПродажах</registeredDocuments>
  <registeredDocuments>Document.ПоступлениеТоваровУслуг</registeredDocuments>
  <registeredDocuments>Document.ПриходныйКассовыйОрдер</registeredDocuments>
  <registeredDocuments>Document.РасходныйКассовыйОрдер</registeredDocuments>
  <registeredDocuments>Document.РеализацияТоваровУслуг</registeredDocuments>
  <registeredDocuments>Document.СписаниеТоваров</registeredDocuments>
  <registeredDocuments>Document.ОприходованиеТоваров</registeredDocuments>
  <registeredDocuments>Document.ОтчетОРозничныхПродажах</registeredDocuments>
  <registeredDocuments>Document.ВозвратТоваровОтПокупателя</registeredDocuments>
  <registeredDocuments>Document.ВозвратТоваровПоставщику</registeredDocuments>
  <registeredDocuments>Document.ПеремещениеТоваров</registeredDocuments>
  <registeredDocuments>Document.ПереоценкаТоваровВРознице</registeredDocuments>
  <registeredDocuments>Document.ПоступлениеНаРасчетныйСчет</registeredDocuments>
  <registeredDocuments>Document.СписаниеСРасчетногоСчета</registeredDocuments>
  <registeredDocuments>Document.ФормированиеЗаписейКнигиПокупок</registeredDocuments>
  <registeredDocuments>Document.ФормированиеЗаписейКнигиПродаж</registeredDocuments>
  <registeredDocuments>Document.РеализацияОтгруженныхТоваров</registeredDocuments>
  <registeredDocuments>Document.КомплектацияНоменклатуры</registeredDocuments>
  <registeredDocuments>Document.ОтражениеНДСКВычету</registeredDocuments>
  <registeredDocuments>Document.ОтражениеНачисленияНДС</registeredDocuments>
  <registeredDocuments>Document.РегламентнаяОперация</registeredDocuments>
  <registeredDocuments>Document.ПоступлениеДенежныхДокументов</registeredDocuments>
  <registeredDocuments>Document.ВыдачаДенежныхДокументов</registeredDocuments>
  <registeredDocuments>Document.НачислениеЗарплаты</registeredDocuments>
  <registeredDocuments>Document.ПередачаОборудованияВМонтаж</registeredDocuments>
  <registeredDocuments>Document.ПодготовкаКПередачеОС</registeredDocuments>
  <registeredDocuments>Document.ПринятиеКУчетуОС</registeredDocuments>
  <registeredDocuments>Document.МодернизацияОС</registeredDocuments>
  <registeredDocuments>Document.ПеремещениеОС</registeredDocuments>
  <registeredDocuments>Document.СписаниеОС</registeredDocuments>
  <registeredDocuments>Document.ПередачаОС</registeredDocuments>
  <registeredDocuments>Document.ТребованиеНакладная</registeredDocuments>
  <registeredDocuments>Document.АктОбОказанииПроизводственныхУслуг</registeredDocuments>
  <registeredDocuments>Document.ОтчетПроизводстваЗаСмену</registeredDocuments>
  <registeredDocuments>Document.ПередачаТоваров</registeredDocuments>
  <registeredDocuments>Document.РеализацияУслугПоПереработке</registeredDocuments>
  <registeredDocuments>Document.ПоступлениеИзПереработки</registeredDocuments>
  <registeredDocuments>Document.ВозвратМатериаловИзЭксплуатации</registeredDocuments>
  <registeredDocuments>Document.ПередачаМатериаловВЭксплуатацию</registeredDocuments>
  <registeredDocuments>Document.СписаниеМатериаловИзЭксплуатации</registeredDocuments>
  <registeredDocuments>Document.ВводНачальныхОстатков</registeredDocuments>
  <registeredDocuments>Document.ВосстановлениеНДС</registeredDocuments>
  <registeredDocuments>Document.ВосстановлениеНДСПоОбъектамНедвижимости</registeredDocuments>
  <registeredDocuments>Document.ГТДИмпорт</registeredDocuments>
  <registeredDocuments>Document.КорректировкаДолга</registeredDocuments>
  <registeredDocuments>Document.НачислениеНДСпоСМРхозспособом</registeredDocuments>
  <registeredDocuments>Document.ПередачаНМА</registeredDocuments>
  <registeredDocuments>Document.ПодтверждениеНулевойСтавкиНДС</registeredDocuments>
  <registeredDocuments>Document.ПоступлениеДопРасходов</registeredDocuments>
  <registeredDocuments>Document.ПоступлениеНМА</registeredDocuments>
  <registeredDocuments>Document.ПринятиеКУчетуНМА</registeredDocuments>
  <registeredDocuments>Document.РаспределениеНДС</registeredDocuments>
  <registeredDocuments>Document.СписаниеНДС</registeredDocuments>
  <registeredDocuments>Document.СписаниеНМА</registeredDocuments>
  <registeredDocuments>Document.ДепонированиеЗарплаты</registeredDocuments>
  <registeredDocuments>Document.СписаниеДепонированнойЗарплаты</registeredDocuments>
  <registeredDocuments>Document.ОтражениеЗарплатыВУчете</registeredDocuments>
  <registeredDocuments>Document.ОказаниеУслуг</registeredDocuments>
  <registeredDocuments>Document.КорректировкаПоступления</registeredDocuments>
  <registeredDocuments>Document.КорректировкаРеализации</registeredDocuments>
  <registeredDocuments>Document.ОтражениеЗарплатыВБухучете</registeredDocuments>
  <registeredDocuments>Document.АктСверкиВзаиморасчетов</registeredDocuments>
  <registeredDocuments>Document.ЗаписьКнигиУчетаДоходовИРасходовИП</registeredDocuments>
  <registeredDocuments>Document.ЗаписьКУДиР</registeredDocuments>
  <registeredDocuments>Document.РегистрацияОплатыОсновныхСредствДляИП</registeredDocuments>
  <registeredDocuments>Document.РегистрацияОплатыОсновныхСредствДляУСН</registeredDocuments>
  <registeredDocuments>Document.СчетНаОплатуПокупателю</registeredDocuments>
  <registeredDocuments>Document.СчетФактураВыданный</registeredDocuments>
  <registeredDocuments>Document.СчетФактураПолученный</registeredDocuments>
  <registeredDocuments>Document.ИнвентаризацияНЗП</registeredDocuments>
  <registeredDocuments>Document.СчетНаОплатуПоставщика</registeredDocuments>
  <registeredDocuments>Document.ОплатаПлатежнойКартой</registeredDocuments>
  <registeredDocuments>Document.ЗаявлениеОВвозеТоваров</registeredDocuments>
  <registeredDocuments>Document.БольничныйЛист</registeredDocuments>
  <registeredDocuments>Document.Отпуск</registeredDocuments>
  <registeredDocuments>Document.ПоступлениеВЛизинг</registeredDocuments>
  <registeredDocuments>Document.ПлатежноеПоручение</registeredDocuments>
  <registeredDocuments>Document.ВыкупПредметовЛизинга</registeredDocuments>
  <registeredDocuments>Document.НачислениеПеней</registeredDocuments>
  <registeredDocuments>Document.ТаможеннаяДекларацияЭкспорт</registeredDocuments>
  <registeredDocuments>Document.РасходыПредпринимателя</registeredDocuments>
  <registeredDocuments>Document.ОтчетОператораСистемыПлатон</registeredDocuments>
  <registeredDocuments>Document.ФормированиеУставногоКапитала</registeredDocuments>
  <registeredDocuments>Document.ПередачаОСВАренду</registeredDocuments>
  <registeredDocuments>Document.ВозвратОСОтАрендатора</registeredDocuments>
  <registeredDocuments>Document.ПлатежноеТребование</registeredDocuments>
  <registeredDocuments>Document.ФормированиеЗаписейРаздела7ДекларацииНДС</registeredDocuments>
  <registeredDocuments>Document.ПередачаЗадолженностиНаФакторинг</registeredDocuments>
  <columns>
    <name>Организация</name>
  </columns>
  <columns>
    <name>Информация</name>
  </columns>
  <columns>
    <name>РучнаяКорректировка</name>
  </columns>
  <columns>
    <name>СостояниеРеглОперации</name>
  </columns>
  <columns>
    <name>СуммаДокумента</name>
  </columns>
  <columns>
    <name>ВалютаДокумента</name>
  </columns>
  <columns>
    <name>ВидОперации</name>
  </columns>
  <columns>
    <name>ДоговорКонтрагента</name>
  </columns>
  <columns>
    <name>НомерВходящегоДокумента</name>
  </columns>
  <columns>
    <name>ДатаВходящегоДокумента</name>
  </columns>
  <columns>
    <name>Ответственный</name>
  </columns>
  <columns>
    <name>Комментарий</name>
  </columns>
</mdclass:DocumentJournal>

УчетВУправляющихДляГит1/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтраховойНомерПФР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоРождения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>240</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.ГруппыДоступаФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПол</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.УдалитьПолФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УточнениеНаименования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <comment>Дата регистрации</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСлужебное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойБанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ПостоянноПроживалВКрыму18Марта2014Года</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнициалыИмени</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоРожденияПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>240</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛьготаПриНачисленииПособий</name>
    <type>
      <types>EnumRef.ОснованияФинансированияПособияФедеральнымБюджетом</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеИзображение</name>
    <type>
      <types>CatalogRef.УПЖКХ_ПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ОсновноеИзображение</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Удалить_КВП_ХранилищеДополнительнойИнформации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УчетВУправляющихДляГит1/src/DocumentJournals/ЖурналОпераций/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УИДЗамера = Параметры.УИДЗамера;
	
	МожноРедактировать = ПравоДоступа("Редактирование", Метаданные.Документы.ОперацияБух);
	Элементы.СписокКонтекстноеМенюИзменитьВыделенные.Видимость = МожноРедактировать;
	
	ЗапрещенныеПоля = Новый Массив;
	ЗапрещенныеПоля.Добавить("ПараметрыДанных");
	Список.УстановитьОграниченияИспользованияВОтборе(ЗапрещенныеПоля);
	
	Если Параметры.КлючНазначенияИспользования = "ДокументыПокупателей"
	 Или Параметры.КлючНазначенияИспользования = "ДокументыПоставщиков" Тогда
	 
		ТипыДокументов = ЖурналыДокументов.ЖурналОпераций.СписокТиповПоНазначениюИспользования(
			Параметры.КлючНазначенияИспользования);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
			Список, "ОтборТипыДокументов", ТипыДокументов, Истина);
		ИспользуетсяПодсистемаЗарплата = Ложь;
			
	Иначе
			
		ИспользуетсяПодсистемаЗарплата = ПолучитьФункциональнуюОпцию("УчетЗарплатыИКадровСредствамиБухгалтерии")
			Или ПолучитьФункциональнуюОпцию("УчетЗарплатыИКадровВоВнешнейПрограмме");
			
	КонецЕсли;
	
	ИспользуетсяНесколькоОрганизаций = Справочники.Организации.ИспользуетсяНесколькоОрганизаций();
	
	ТипИнформации = "Контрагент";
	НастроитьВнешнийВидОтбораИнформация();
	УстановитьОграничениеТипаОтбораИнформации(ЭтотОбъект);
	
	Если Не ПустаяСтрока(Параметры.Заголовок) Тогда
		АвтоЗаголовок = Ложь;
		Заголовок = Параметры.Заголовок;
	КонецЕсли;
	
	Если КлючНазначенияИспользования = "ДокументыПоКонтрагенту" Тогда
		
		// Отбор по контрагенту
		ОтборИнформацияИспользование = Параметры.Отбор.Свойство("Контрагент", ОтборИнформация)
			И ЗначениеЗаполнено(ОтборИнформация);
		Если Не ОтборИнформацияИспользование Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не указан контрагент для показа документов.'"));
			Отказ = Истина;
		КонецЕсли;
		
		ИспользуетсяОтборПоКритериюОтбора = Истина; // отбор по контрагенту накладывается при открытии и не изменяется
		
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
			Список, "ОтборКонтрагент", ОтборИнформация, ОтборИнформацияИспользование);
		ОтборКонтрагент = ОтборИнформация;
		Элементы.ГруппаОтборИнформация.Видимость = Ложь;
		Параметры.Отбор.Удалить("Контрагент");
		Элементы.СписокИнформация.Видимость = Ложь;
		
		Элементы.СписокОрганизация.Видимость = ИспользуетсяНесколькоОрганизаций;
		// Отбор по основной организации
		Если ИспользуетсяНесколькоОрганизаций Тогда
			ОтборОрганизация = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
			ОтборОрганизацияИспользование = ЗначениеЗаполнено(ОтборОрганизация);
			ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "Организация");
		КонецЕсли;
		
		УстановитьСвязиПараметровВыбораДоговораКонтрагента();
		Элементы.СписокДоговорКонтрагента.Видимость = РаботаСДоговорамиКонтрагентовБПВызовСервера.ВестиУчетПоДоговорам();
		Элементы.ГруппаОтборДоговорКонтрагента.Видимость = Элементы.СписокДоговорКонтрагента.Видимость;
		
	ИначеЕсли КлючНазначенияИспользования = "ДокументыПоДоговоруКонтрагента" Тогда
		
		ОтборДоговорКонтрагентаИспользование = Параметры.Отбор.Свойство("ДоговорКонтрагента", ОтборДоговорКонтрагента)
			И ЗначениеЗаполнено(ОтборДоговорКонтрагента);
		Если Не ОтборДоговорКонтрагентаИспользование Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не указан договор контрагента для показа документов.'"));
			Отказ = Истина;
		КонецЕсли;
		
		ИспользуетсяОтборПоКритериюОтбора = Истина; // отбор по договору накладывается при открытии и не изменяется
		
		ОтборИнформацияИспользование = Ложь;
		Элементы.ГруппаОтборИнформация.Видимость = Ложь;
		Элементы.СписокИнформация.Видимость = Ложь;
		
		ОтборОрганизацияИспользование = Ложь;
		Элементы.ГруппаОтборОрганизация.Видимость = Ложь;
		Элементы.СписокОрганизация.Видимость = ИспользуетсяНесколькоОрганизаций
			И БухгалтерскийУчетПереопределяемый.ВестиУчетПоПодразделениям();
			
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
			Список, "ОтборДоговорКонтрагента", ОтборДоговорКонтрагента, ОтборДоговорКонтрагентаИспользование);
		Элементы.ГруппаОтборДоговорКонтрагента.Видимость = Ложь;
		Параметры.Отбор.Удалить("ДоговорКонтрагента");
		
	Иначе
		
		ИспользуетсяОтборПоКритериюОтбора = Ложь; // отборы по контрагенту и договору могут изменяться после открытия
		
		Элементы.СписокОрганизация.Видимость = ИспользуетсяНесколькоОрганизаций;
		// Отбор по основной организации
		Если ИспользуетсяНесколькоОрганизаций Тогда
			ОтборОрганизация = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
			ОтборОрганизацияИспользование = ЗначениеЗаполнено(ОтборОрганизация);
			ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "Организация");
		КонецЕсли;
		
		Элементы.ГруппаОтборДоговорКонтрагента.Видимость = Ложь;
		
		// СтандартныеПодсистемы.ПодключаемыеКоманды
		ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
		ПараметрыРазмещения.КоманднаяПанель = Элементы.ГруппаГлобальныеКоманды;
		ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
		// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
		
	КонецЕсли;
	
	// ИнтернетПоддержкаПользователей.Новости.КонтекстныеНовости_ПриСозданииНаСервере
	ИдентификаторыСобытийПриОткрытии = "ПриОткрытии";
	ОбработкаНовостейПереопределяемый.КонтекстныеНовости_ПриСозданииНаСервере(
		ЭтаФорма,
		"БП.ЖурналДокументов.ЖурналОпераций",
		"ФормаСписка",
		НСтр("ru='Новости: Журнал операций'"),
		ИдентификаторыСобытийПриОткрытии
	);
	// Конец ИнтернетПоддержкаПользователей.Новости.КонтекстныеНовости_ПриСозданииНаСервере
	
	
	ТарификацияБП.РазместитьИнформациюОбОграниченииПоКоличествуОбъектов(ЭтотОбъект);
	
	АдресХранилищаНастройкиДинСпискаДляРеестра = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Если ПустаяСтрока(КлючНазначенияИспользования) Тогда
		// По графе "Информация" может быть быстрый отбор как по контрагенту, так и по сотруднику.
		
		Если ТипЗнч(Настройки["ОтборИнформация"]) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			
			Если Элементы.ТипИнформации.СписокВыбора.НайтиПоЗначению("Сотрудник") <> Неопределено Тогда
				
				ТипИнформации = "Сотрудник";
				
			Иначе
				
				ТипИнформации                = "Контрагент";
				ОтборИнформация              = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
				ОтборИнформацияИспользование = Ложь;
				
			КонецЕсли;
			
		Иначе
			
			ТипИнформации = "Контрагент";
			ОтборКонтрагент = ОтборИнформация;
			
		КонецЕсли;
		УстановитьОграничениеТипаОтбораИнформации(ЭтотОбъект);
		ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "Информация");	
		
	Иначе
		// По графе "Информация" может быть быстрый отбор только по контрагенту.
		
		ТипИнформации = "Контрагент";
		Если ТипЗнч(ОтборИнформация) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			// Обрабатываем некорректно сохраненные настройки.
			ОтборИнформация              = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
			ОтборИнформацияИспользование = Ложь;
			
			УстановитьОграничениеТипаОтбораИнформации(ЭтотОбъект);
			
		КонецЕсли;
		
		Если ИспользуетсяОтборПоКритериюОтбора Тогда
			
			Если КлючНазначенияИспользования = "ДокументыПоКонтрагенту" Тогда // не изменяем контрагента
				
				ОтборИнформация = ОтборКонтрагент;
				
				Если ЗначениеЗаполнено(ОтборИнформация)
				   И ЗначениеЗаполнено(ОтборДоговорКонтрагента)
				   И ОтборКонтрагент <> ПараметрыВыбораДоговораКонтрагента(ОтборДоговорКонтрагента).Владелец Тогда
					// Обрабатываем некорректно сохраненные настройки.
					ОтборДоговорКонтрагентаИспользование = Ложь;
					ОтборДоговорКонтрагента = Неопределено;
				КонецЕсли;
				УстановитьСвязиПараметровВыбораДоговораКонтрагента();
				ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "ДоговорКонтрагента");
				
			ИначеЕсли КлючНазначенияИспользования = "ДокументыПоДоговоруКонтрагента" Тогда // не изменяем договор
				
				ПараметрКомпоновкиДанных = Новый ПараметрКомпоновкиДанных("ОтборДоговорКонтрагента");
				ЗначениеПараметраКомпоновкиДанных = Список.Параметры.НайтиЗначениеПараметра(ПараметрКомпоновкиДанных);
				ОтборДоговорКонтрагента = ?(ЗначениеПараметраКомпоновкиДанных = Неопределено,
					Справочники.ДоговорыКонтрагентов.ПустаяСсылка(),
					ЗначениеПараметраКомпоновкиДанных.Значение);
					
			Иначе // обрабатываем некорректно сохраненные настройки
					
				ОтборИнформация = ОтборКонтрагент;
				ОтборДоговорКонтрагента = Неопределено;
				
			КонецЕсли;
			
		Иначе
			
			ОтборКонтрагент = ОтборИнформация;
			ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "Информация");
			
			Если ЗначениеЗаполнено(ОтборИнформация)
			   И ЗначениеЗаполнено(ОтборДоговорКонтрагента)
			   И ОтборКонтрагент <> ПараметрыВыбораДоговораКонтрагента(ОтборДоговорКонтрагента).Владелец Тогда
				// Обрабатываем некорректно сохраненные настройки.
				ОтборДоговорКонтрагентаИспользование = Ложь;
				ОтборДоговорКонтрагента = Неопределено;
			КонецЕсли;
			ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "ДоговорКонтрагента");
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ИзменениеОсновнойОрганизации" Тогда
		
		ОтборОрганизация = Параметр;
		ОтборОрганизацияИспользование = ЗначениеЗаполнено(ОтборОрганизация);
		ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "Организация");
		
		Если КлючНазначенияИспользования = "ДокументыПоКонтрагенту" Тогда
			УстановитьСвязиПараметровВыбораДоговораКонтрагента();
		КонецЕсли;
		
	КонецЕсли;
	
	// ИнтернетПоддержкаПользователей.Новости.ОбработкаОповещения
	ОбработкаНовостейКлиент.КонтекстныеНовости_ОбработкаОповещения(ЭтаФорма, ИмяСобытия, Параметр, Источник);
	// Конец ИнтернетПоддержкаПользователей.Новости.ОбработкаОповещения
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Строка") Или ПустаяСтрока(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	
	Если ЗначениеЗаполнено(ОтборДокумент) Тогда
		
		ПараметрыОткрытияДокумента = Неопределено;
		
		Если ВыбранноеЗначение = "КорректировкаСчетаФактурыВыданного" Тогда
		
			ПараметрыОткрытияДокумента = УчетНДСКлиент.ПараметрыКорректировкиСчетаФактурыВыданного(ОтборДокумент);
			
		ИначеЕсли ВыбранноеЗначение = "ИсправлениеСчетаФактурыВыданного" Тогда
			
			ПараметрыОткрытияДокумента = УчетНДСКлиент.ПараметрыИсправленияСчетаФактурыВыданного(ОтборДокумент);
			
		ИначеЕсли ВыбранноеЗначение = "КорректировкаСчетаФактурыПолученного" Тогда
			
			ПараметрыОткрытияДокумента = УчетНДСКлиент.ПараметрыКорректировкиСчетаФактурыПолученного(ОтборДокумент);
			
		ИначеЕсли ВыбранноеЗначение = "ИсправлениеСчетаФактурыПолученного" Тогда
			
			ПараметрыОткрытияДокумента = УчетНДСКлиент.ПараметрыИсправленияСчетаФактурыПолученного(ОтборДокумент);
			
		ИначеЕсли ВыбранноеЗначение = "СобственнаяОшибкаСчетФактураПолученный" Тогда
			
			ПараметрыОткрытияДокумента = УчетНДСКлиент.ПараметрыИсправленияСчетаФактурыПолученного(ОтборДокумент, Истина);
			
		ИначеЕсли ВыбранноеЗначение = "СчетФактураВыданныйНаАвансКомитента" Тогда
		
			ПараметрыОткрытияДокумента = УчетНДСКлиент.ПараметрыСчетФактураВыданныйНаАвансКомитента(ОтборДокумент);
		
		ИначеЕсли ВыбранноеЗначение = "БезвозмезднаяПередача" Тогда
		
			ПараметрыОткрытияДокумента = ПараметрыВводаНаОснованииБезвозмезднаяПередача(ОтборДокумент);
			
		Иначе
		
			ПараметрыФормы.Вставить("Основание", ОтборДокумент);
		
		КонецЕсли; 
		
		Если ПараметрыОткрытияДокумента <> Неопределено Тогда
		
			ВыбранноеЗначение = ПараметрыОткрытияДокумента.ИмяДокумента;
			ПараметрыФормы    = ПараметрыОткрытияДокумента.ПараметрыФормы;
			
		КонецЕсли; 
		
		ОтборДокумент = Неопределено;
		
	Иначе
		
		СвойстваДоговора = Неопределено;
		Если ОтборДоговорКонтрагентаИспользование И ЗначениеЗаполнено(ОтборДоговорКонтрагента) Тогда
			СвойстваДоговора = ПараметрыВыбораДоговораКонтрагента(ОтборДоговорКонтрагента);
		КонецЕсли;
		
		ЗначенияЗаполнения = Новый Структура;
			
		Если ОтборОрганизацияИспользование Тогда
			ЗначенияЗаполнения.Вставить("Организация", ОтборОрганизация);
		ИначеЕсли СвойстваДоговора <> Неопределено Тогда
			ЗначенияЗаполнения.Вставить("Организация", СвойстваДоговора.Организация);
		КонецЕсли;
		
		Если ОтборИнформацияИспользование Тогда
			Если ТипИнформации = "Сотрудник" Тогда
				ЗначенияЗаполнения.Вставить("ФизЛицо", ОтборИнформация);
			Иначе
				Если ВыбранноеЗначение = "КорректировкаДолга" Тогда
					ЗначенияЗаполнения.Вставить("КонтрагентДебитор",  ОтборИнформация);
					ЗначенияЗаполнения.Вставить("КонтрагентКредитор", ОтборИнформация);
				Иначе
					ЗначенияЗаполнения.Вставить("Контрагент", ОтборИнформация);
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли СвойстваДоговора <> Неопределено Тогда
			ЗначенияЗаполнения.Вставить("Контрагент", СвойстваДоговора.Владелец);
		КонецЕсли;
		
		Если ОтборДоговорКонтрагентаИспользование Тогда
			Если Не ЗначенияЗаполнения.Свойство("Контрагент")
			   И ЗначениеЗаполнено(ОтборИнформация) Тогда
				ЗначенияЗаполнения.Вставить("Контрагент", ОтборИнформация);
			КонецЕсли;
			ЗначенияЗаполнения.Вставить("ДоговорКонтрагента", ОтборДоговорКонтрагента);
		КонецЕсли;
		
		ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
			
	КонецЕсли; 
	
	ОткрытьФорму("Документ." + ВыбранноеЗначение + ".ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Отнесем замеряемую операцию к определенному виду.
	Если ЗначениеЗаполнено(УИДЗамера) Тогда
		
		Если Параметры.КлючНазначенияИспользования = "ДокументыПокупателей" Тогда
			ИмяКлючевойОперации = "ОткрытиеФормыЖурналОперацийПокупателей";
		ИначеЕсли Параметры.КлючНазначенияИспользования = "ДокументыПоставщиков" Тогда
			ИмяКлючевойОперации = "ОткрытиеФормыЖурналОперацийПоставщиков";
		ИначеЕсли Параметры.КлючНазначенияИспользования = "ДокументыПоКонтрагенту" Тогда
			ИмяКлючевойОперации = "ОткрытиеФормыЖурналОперацийПоКонтрагенту";
		ИначеЕсли Параметры.КлючНазначенияИспользования = "ДокументыПоДоговоруКонтрагента" Тогда
			ИмяКлючевойОперации = "ОткрытиеФормыЖурналОперацийПоДоговоруКонтрагента";
		Иначе
			ИмяКлючевойОперации = "ОткрытиеФормыЖурналОпераций";
		КонецЕсли;
		ОценкаПроизводительностиКлиент.УстановитьКлючевуюОперациюЗамера(УИДЗамера, ИмяКлючевойОперации);
		
	КонецЕсли;
	
	РеквизитыОрганизацииЗаполнены = ОбщегоНазначенияБПКлиент.ПроверитьНаличиеОрганизаций();
	
	Если РеквизитыОрганизацииЗаполнены Тогда
		
		// ИнтернетПоддержкаПользователей.Новости.ПриОткрытии
		ОбработкаНовостейКлиент.КонтекстныеНовости_ПриОткрытии(ЭтаФорма);
		// Конец ИнтернетПоддержкаПользователей.Новости.ПриОткрытии
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборОрганизацияИспользованиеПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "Организация");
	
	Если КлючНазначенияИспользования = "ДокументыПоКонтрагенту" Тогда
		УстановитьСвязиПараметровВыбораДоговораКонтрагента();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ОтборОрганизация) Тогда
		ОтборОрганизацияИспользование = Истина;
	КонецЕсли;
	
	ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "Организация");
	
	Если КлючНазначенияИспользования = "ДокументыПоКонтрагенту" Тогда
		УстановитьСвязиПараметровВыбораДоговораКонтрагента();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипИнформацииПриИзменении(Элемент)
	
	УстановитьОграничениеТипаОтбораИнформации(ЭтотОбъект);
	ОтборИнформацияИспользование = Ложь;
	ОтборДоговорКонтрагентаИспользование = Ложь;
	Если ТипИнформации = "Сотрудник" Тогда
		
		ОтборИнформация = ПредопределенноеЗначение("Справочник.ФизическиеЛица.ПустаяСсылка");
			
	Иначе
			
		ОтборИнформация = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
		ОтборДоговорКонтрагента = Неопределено;
		
	КонецЕсли;
	
	ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "Информация");
	ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "ДоговорКонтрагента");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборИнформацияИспользованиеПриИзменении(Элемент)
	
	Если ТипИнформации = "Контрагент" Тогда
		ОтборКонтрагент = ОтборИнформация;
	КонецЕсли;
		
	ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "Информация");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборИнформацияПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ОтборИнформация) Тогда
		ОтборИнформацияИспользование = Истина;
	КонецЕсли;
	
	Если ТипИнформации = "Контрагент" Тогда
		ОтборКонтрагент = ОтборИнформация;
	КонецЕсли;	
	
	ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "Информация");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборДоговорКонтрагентаИспользованиеПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "ДоговорКонтрагента");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборДоговорКонтрагентаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ОтборДоговорКонтрагента) Тогда
		ОтборДоговорКонтрагентаИспользование = Истина;
	КонецЕсли;
	
	ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "ДоговорКонтрагента");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Не Копирование Тогда
		
		Отказ = Истина;
		
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("КлючНазначенияИспользования", КлючНазначенияИспользования);
		
		Если ТекущиеДанные <> Неопределено Тогда
			ПараметрыФормы.Вставить("НачальноеЗначение", ТипЗнч(ТекущиеДанные.Ссылка));
		КонецЕсли;
		
		ОткрытьФорму("ЖурналДокументов.ЖурналОпераций.Форма.ВыборТипаДокумента", ПараметрыФормы, ЭтотОбъект, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	
	Если БухгалтерскийУчетКлиентСерверПереопределяемый.ЭтоРегламентнаяОперация(Элемент.ТекущаяСтрока)
		И Элемент.ТекущиеДанные <> Неопределено
		И Элемент.ТекущиеДанные.СостояниеДокумента = 1 Тогда
		Оповестить("ОбновитьЗакрытиеМесяца");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПереключитьАктивностьПроводок(Команда)

	ТекДанные = Элементы.Список.ТекущиеДанные;

	Если ТекДанные = Неопределено Тогда
		ПоказатьПредупреждение( , НСтр("ru = 'Не выбран документ'"));
		Возврат;
	КонецЕсли;

	ПереключитьАктивностьПроводокСервер(ТекДанные.Ссылка);

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНаОсновании(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КлючНазначенияИспользования", КлючНазначенияИспользования);
	
	Если ТекущиеДанные <> Неопределено Тогда
		ОтборДокумент = ТекущиеДанные.Ссылка;
		ПараметрыФормы.Вставить("Основание", ТекущиеДанные.Ссылка);
	КонецЕсли;
	
	ОткрытьФорму("ЖурналДокументов.ЖурналОпераций.Форма.ВыборТипаДокумента", ПараметрыФормы, ЭтотОбъект, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьКонтекстныеНовости(Команда)

	ОбработкаНовостейКлиент.КонтекстныеНовости_ОбработкаКомандыНовости(
		ЭтаФорма,
		Команда
	);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПараметрыВводаНаОснованииБезвозмезднаяПередача(ОтборДокумент)

	ПараметрыОткрытияДокумента = Новый Структура("ИмяДокумента, ПараметрыФормы");
	ПараметрыОткрытияДокумента.ИмяДокумента = "ПередачаТоваров";
	
	ПараметрыОснования = Новый Структура("БезвозмезднаяПередача, ДокументОснование", Истина, ОтборДокумент);
	ПараметрыОткрытияДокумента.ПараметрыФормы = Новый Структура("Основание", ПараметрыОснования);

	Возврат ПараметрыОткрытияДокумента;
	
КонецФункции


// Процедура показывает новости, требующие прочтения (важные и очень важные)
//
// Параметры:
//  Нет
//
&НаКлиенте
Процедура Подключаемый_ПоказатьНовостиТребующиеПрочтенияПриОткрытии()

	// ИнтернетПоддержкаПользователей.Новости.Подключаемый_ПоказатьНовостиТребующиеПрочтенияПриОткрытии
	ИдентификаторыСобытийПриОткрытии = "ПриОткрытии";
	// Конец ИнтернетПоддержкаПользователей.Новости.Подключаемый_ПоказатьНовостиТребующиеПрочтенияПриОткрытии

	ОбработкаНовостейКлиент.КонтекстныеНовости_ПоказатьНовостиТребующиеПрочтенияПриОткрытии(ЭтаФорма, ИдентификаторыСобытийПриОткрытии);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПереключитьАктивностьПроводокСервер(ТекДокумент)

	БухгалтерскийУчет.ПереключитьАктивностьПроводокБУ(ТекДокумент);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОграничениеТипаОтбораИнформации(Форма)

	Если Форма.ТипИнформации = "Сотрудник" Тогда
		Форма.Элементы.ОтборИнформация.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица");
	Иначе
		Форма.Элементы.ОтборИнформация.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура НастроитьВнешнийВидОтбораИнформация()

	ТипыОтбора = Элементы.ТипИнформации.СписокВыбора;
	
	Если Не ИспользуетсяПодсистемаЗарплата Тогда
		ЭлементОтборСотрудник = ТипыОтбора.НайтиПоЗначению("Сотрудник");
		Если ЭлементОтборСотрудник <> Неопределено Тогда
			ТипыОтбора.Удалить(ЭлементОтборСотрудник);
		КонецЕсли;
	КонецЕсли;
	
	ЕдинственныйТипОтбора = ТипыОтбора.Количество() = 1;
	
	Элементы.ТипИнформации.Видимость = Не ЕдинственныйТипОтбора;
	Элементы.ОтборИнформацияИспользование.ПоложениеЗаголовка = ?(ЕдинственныйТипОтбора,
		ПоложениеЗаголовкаЭлементаФормы.Лево, ПоложениеЗаголовкаЭлементаФормы.Нет);
	
	Если ЕдинственныйТипОтбора Тогда
		
		// Установим название отбора из единственного доступного типа
		НазваниеОтбора = СтрЗаменить(ТипыОтбора[0].Представление, ":", "");
		
		Элементы.ОтборИнформацияИспользование.Заголовок = НазваниеОтбора;
		Элементы.СписокИнформация.Заголовок = НазваниеОтбора; 
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьСвязиПараметровВыбораДоговораКонтрагента()

	МассивСвязей = Новый Массив;
	
	Если ОтборИнформацияИспользование Тогда
		МассивСвязей.Добавить(Новый СвязьПараметраВыбора("Отбор.Владелец", "ОтборИнформация", РежимИзмененияСвязанногоЗначения.Очищать));
	КонецЕсли;
	
	Если ОтборОрганизацияИспользование Тогда
		МассивСвязей.Добавить(Новый СвязьПараметраВыбора("Отбор.Организация", "ОтборОрганизация", РежимИзмененияСвязанногоЗначения.Очищать));
	КонецЕсли;
	
	Элементы.ОтборДоговорКонтрагента.СвязиПараметровВыбора = Новый ФиксированныйМассив(МассивСвязей);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПараметрыВыбораДоговораКонтрагента(Знач ДоговорКонтрагента)
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДоговорКонтрагента, "Владелец, Организация");
	
КонецФункции

&НаСервере
Процедура НастройкиДинамическогоСписка()
	
	Отчеты.РеестрДокументов.НастройкиДинамическогоСписка(ЭтотОбъект);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	Если Команда.Имя = "ПодменюПечатьОбычное_Реестр" Тогда
		НастройкиДинамическогоСписка();
	КонецЕсли;
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
